app/Controllers/AuthController.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `fecha_nacimiento`, `correo`, `contrasena`, `telefono`, `rol`, `created_at`, `updated_at`) VALUES ('Diana', 'Bello', '2023-02-02', 'diana1@test.do', '$2y$10$7Q1N61v8jOlgnmXkJ53rKOJQ86KqO7/NyHqBH1Cc/LVuuZ/hP8T3K', '+18294687156', 'SHOPPER', '2025-04-03 08:34:27', '2025-04-03 08:34:27')
---
    public function register()
    {
        $data = $this->request->getJSON(true);

        // Validaciones básicas
        if (!$data || !isset($data['correo'], $data['contrasena'])) {
            return $this->failValidationError('Correo y contraseña son obligatorios.');
        }

        // Verificar si ya existe un usuario con ese correo
        $usuarioExistente = $this->model->where('correo', $data['correo'])->first();
        if ($usuarioExistente) {
            return $this->failResourceExists('El correo ya está registrado.');
        }

        // Hashear la contraseña
        $data['contrasena'] = password_hash($data['contrasena'], PASSWORD_DEFAULT);

        // Rol por defecto
        $data['rol'] = 'SHOPPER';

        // Guardar en la base de datos
        if (!$this->model->insert($data)) {