app/Controllers/Chatbot.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $mensaje = $this->request->getJSON(true)['mensaje'] ?? null;

        if (!$mensaje) {
            return $this->respond(['error' => 'Mensaje no proporcionado'], 400);
        }

        // Obtener productos del modelo
        $productoModel = new \App\Models\Producto();
        $productos = $productoModel->findAll();