app/Controllers/Pedido.php

SELECT *
FROM `pedidos_detalle`
WHERE `pedido_id` = '1'
---
    public function index()
    {
        $rol = session()->get('rol');
        if ($rol !== 'ADMIN') {
            return $this->respond([
                'error' => 'Acceso no autorizado. Solo administradores pueden ver todos los pedidos.'
            ], 403);
        }

        $pedidos = $this->model->findAll();
        $detalleModel = new \App\Models\PedidosDetalle();

        foreach ($pedidos as &$pedido) {
            $pedido['productos'] = $detalleModel->where('pedido_id', $pedido['id'])->findAll();

SELECT *
FROM `pedidos_detalle`
WHERE `pedido_id` = '10'
---
    public function misPedidos()
    {
        $usuarioId = session()->get('usuario_id');
        if (!$usuarioId) {
            return $this->respond([
                'error' => 'Debes iniciar sesión para ver tus pedidos.'
            ], 401);
        }

        $detalleModel = new \App\Models\PedidosDetalle();
        $pedidos = $this->model->where('usuario_id', $usuarioId)->findAll();

        foreach ($pedidos as &$pedido) {
            $pedido['productos'] = $detalleModel->where('pedido_id', $pedido['id'])->findAll();

SELECT *
FROM `pedidos_detalle`
WHERE `pedido_id` = '1'
---
    public function show($id = null)
    {
        $pedido = $this->model->find($id);
        if (!$pedido) {
            return $this->failNotFound('Pedido no encontrado');
        }

        $detalleModel = new \App\Models\PedidosDetalle();
        $pedido['productos'] = $detalleModel->where('pedido_id', $id)->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = 1
---
    public function create()
    {
        $pedidoModel = $this->model;
        $detalleModel = new \App\Models\PedidosDetalle();
        $productoModel = new \App\Models\Producto();

        $usuarioId = session()->get('usuario_id');
        if (!$usuarioId) {
            return $this->respond([
                'error' => 'Debes iniciar sesión para hacer un pedido.'
            ], 401);
        }

        $data = $this->request->getJSON(true);

        if (!isset($data['productos']) || !is_array($data['productos']) || empty($data['productos'])) {
            return $this->respond([
                'error' => 'Debes enviar al menos un producto en el pedido.'
            ], 422);
        }

        $totalPedido = 0;

        foreach ($data['productos'] as $item) {
            if (!isset($item['producto_id']) || !isset($item['cantidad'])) {
                return $this->respond([
                    'error' => 'Cada producto debe tener producto_id y cantidad.'
                ], 422);
            }

            $producto = $productoModel->find($item['producto_id']);