app/Controllers/ProductoController.php

    private function esAdmin(): bool
    {
        $usuarioId = session()->get('usuario_id');
        if (!$usuarioId) return false;

        $usuario = (new Usuario())->find($usuarioId);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'